[
    {
        "name": "Booki",
        "description": "Intégration de l'interface du site Booki en HTML et CSS, à partir d'une maquette réalisée par un UI designer, qui permet à l'utilisateur de trouver des hébergements et activités dans une ville de son choix.",
        "id": 1,
        "tech": ["HTML5", "CSS3"],
        "image": "/images/booki.webp",
        "github": "https://github.com/Kristikus/Booki",
        "demo": "https://kristikus.github.io/Booki/"
    },
    {
        "name": "OhmyFood",
        "description": "Intégration mobile first du site de la startup OhMyFood, avec Sass et quelques animations pour rendre le site plus attractif. L'utilisateur peut naviguer entre les menus proposés, puis composer son propre menu à réserver sur le site afin de limiter le temps d'attente.",
        "id": 2,
        "tech": ["Sass", "HTML5"],
        "image": "/images/ohmyfood.webp",
        "github": "https://github.com/Kristikus/Kristikus.github.io",
        "demo": "https://kristikus.github.io"
    },
    {
        "name": "Print It",
        "description": "L'imprimerie familiale Print It a voulu dynamiser son site déjà existant en intégrant un caroussel interactif à l'aide de Javascript.",
        "id": 3,
        "tech": ["Javascript"],
        "image": "/images/printit.webp",
        "github": "https://github.com/Kristikus/Print-it-P5",
        "demo": "https://kristikus.github.io/Print-it-P5/"
    },
    {
        "name": "Portfolio Sophie Bluel",
        "description": "Trois tâches principales ont éte nécessaires pour le site portfolio de l'architecte d'intérieur Sophie Bluel. D'abord, il y a eu besoin de mettre en place une fonctionnalité de filtre par catégories des photos de l'architecte. Ensuite, pour qu'elle soit la seule à pouvoir ajouter, modifier ou supprimer un de ses travaux, une connexion sécurisée a été mise en place. Enfin, une modale a été créée pour lui permettre de modifier sa galerie de travaux.",
        "id": 4,
        "tech": ["Javascript"],
        "image": "/images/sophiebluel.webp",
        "github": "https://github.com/Kristikus/Portfolio-Sophie-Bluel-P6"
    },
    {
        "name": "Menu Maker By Qwenta",
        "description": "Découverte de la méthodologie agile et de la gestion de projet en menant à bien la plannification du projet Menu Maker de Qwenta",
        "id": 5,
        "tech": ["Gestion projet"],
        "image": "/images/menumaker.webp"
    },
    {
        "name": "Kasa",
        "description": "Refonte du site web de l'agence immobilière Kasa, avec React pour le front-end et React router pour gérer les différentes routes du projet pour permettre de visualiser les annonces de logements.",
        "id": 6,
        "tech": ["React"],
        "image": "/images/kasa.webp",
        "github": "https://github.com/Kristikus/project_kasa"
    },
    {
        "name": "Nina Carducci",
        "description": "Optimisation SEO du site en Javascript de la photographe Nina Carducci, grâce entre autres aux outils Lighthouse et Wave. Un rapport avec les résultats d'optimisation a été rédigé en se basant sur un audit Lighthouse pour les performances et Wave pour l'accessibilité.",
        "id": 7,
        "tech": ["SEO"],
        "image": "/images/ninacarducci.webp",
        "github": "https://github.com/Kristikus/SEO-P9",
        "demo": "https://kristikus.github.io/SEO-P9/"
    },
    {
        "name": "724events",
        "description": "Débogage du code du site de l'agence événementielle 724events pour rendre le site entièrement fonctionnel et agréable à la navigation. Quelques tests unitaires simples ont également été réalisés, accompagnés d'un cahier de recettes regroupant les scénarios utilisateurs au bon fonctionnement du site.",
        "id": 8,
        "tech": ["Test"],
        "image": "/images/724events.webp",
        "github": "https://github.com/Kristikus/Debug-P10"
    },
    {
        "name": "ArgentBank",
        "description": "Réalisation de la connexion uilisateur du front-end du site React d'ArgentBank. Utilisation anticipée de Redux pour gérer le state global de l'application, en particulier pour les données futures des transactions.",
        "id": 9,
        "tech": ["React", "Redux"],
        "image": "/images/argentbank.webp",
        "github": "https://github.com/Kristikus/ArgentBank-P11"
    }
]
  

    
